amarildolacerda/homeware/clients/esp8266_dht_gas/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ArduinoJson.h>
#include <WiFiManager.h>
#include <EEPROM.h>
#include <DHT.h>
#include <ArduinoOTA.h>
#include <Updater.h>
#include <espnow.h>
#include "config.h"
#include "pages.h"
#include "espnow_protocol.h"
#include "common_console.h"
#include "common_espnow.h"
#include "common_web.h"

static const char *TAG = "dht-gas";

static DHT *s_dht = nullptr;

static unsigned long s_last_state_update = 0;
static unsigned long s_last_telemetry_update = 0;
static unsigned long s_last_reconnect_attempt = 0;
static unsigned long s_last_espnow_send = 0;
static unsigned long s_last_espnow_pair = 0;
static unsigned long s_last_heartbeat = 0;

static bool s_gateway_connected = false;
static bool s_paired = false;
static uint8_t s_gateway_mac[6];
static uint16_t s_sequence = 0;
static uint16_t s_assigned_slot = 0;
static int s_pair_attempts = 0;
static bool s_ack_received = false;
static bool s_send_pending = false;
static bool s_espnow_ready = false;
static uint8_t s_my_mac[6];

static unsigned long s_pair_cooldown_end = 0;

enum SendState { SEND_IDLE, SEND_WAIT_ACK, SEND_RETRY_DELAY, SEND_RETRY_WAIT_ACK };
static SendState s_send_state = SEND_IDLE;
static int s_retry_count = 0;
static unsigned long s_ack_deadline = 0;
static unsigned long s_retry_deadline = 0;

static float s_temperature = 0;
static float s_humidity = 0;
static int s_gas_level = 0;
static bool s_alarm = false;
static bool s_sensor_error = false;
static bool s_dht_valid = false;
static int s_battery = 100;
static unsigned long s_start_time = 0;
static uint32_t s_espnow_tx_count = 0;
static uint32_t s_espnow_rx_count = 0;
static unsigned long s_last_send_ms = 0;

static char s_device_id[32];
static char s_device_name[32] = DEVICE_NAME;

static int s_dht_pin = DHT_PIN;
static bool s_enable_temp = true;
static bool s_enable_gas = true;
static bool s_wifi_configuration_mode = false;
static unsigned long s_wifi_config_start_time = 0;

static ESP8266WebServer s_server(80);

static uint8_t s_broadcast_mac[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

#define EEPROM_GATEWAY_MAC_ADDR 0
#define EEPROM_GATEWAY_MAC_SIZE 6
#define EEPROM_NAME_ADDR 10
#define EEPROM_NAME_MAX 48
#define EEPROM_MAGIC 0xAA

static void load_enable_flags(void)
{
    EEPROM.begin(128);
    s_enable_temp = EEPROM.read(EEPROM_ENABLE_ADDR + EEPROM_ENABLE_TEMP_OFFSET) != 0;
    s_enable_gas = EEPROM.read(EEPROM_ENABLE_ADDR + EEPROM_ENABLE_GAS_OFFSET) != 0;
    EEPROM.end();
}

static void save_enable_flags(void)
{
    EEPROM.begin(128);
    EEPROM.write(EEPROM_ENABLE_ADDR + EEPROM_ENABLE_TEMP_OFFSET, s_enable_temp ? 1 : 0);
    EEPROM.write(EEPROM_ENABLE_ADDR + EEPROM_ENABLE_GAS_OFFSET, s_enable_gas ? 1 : 0);
    EEPROM.commit();
    EEPROM.end();
}

static bool espnow_send_heartbeat(void);

extern "C" void espnow_send_cb(uint8_t *mac, uint8_t status)
{
    (void)mac;
    (void)status;
    s_espnow_tx_count++;
}

extern "C" void espnow_recv_cb(uint8_t *mac, uint8_t *data, uint8_t len)
{
    s_espnow_rx_count++;
    if (!data || len < 1) return;

    switch (data[0])
    {
        case ESPNOW_MSG_PAIR_RESPONSE:
        {
            if (len < sizeof(espnow_pair_response_t)) return;
            espnow_pair_response_t *resp = (espnow_pair_response_t *)data;
            if (resp->status == PAIR_STATUS_OK)
            {
                mac_copy(s_gateway_mac, mac);
                s_assigned_slot = resp->assigned_slot;
                espnow_save_gateway_mac(mac, TAG);
                s_paired = true;
                s_gateway_connected = true;
                char mac_str[18];
                mac_to_str(mac, mac_str, sizeof(mac_str));
                console.printf("[%s] Paired with gateway %s slot %d\n", TAG, mac_str, s_assigned_slot);
            }
            else
            {
                console.printf("[%s] Pair response: status=%d\n", TAG, resp->status);
            }
            break;
        }
        case ESPNOW_MSG_ACK:
        {
            if (len < sizeof(espnow_ack_t)) return;
            espnow_ack_t *ack = (espnow_ack_t *)data;
            if (ack->status == PAIR_STATUS_DENIED)
            {
                s_paired = false;
                s_gateway_connected = false;
                console.printf("[%s] Gateway rejected data (denied), need re-pair\n", TAG);
            }
            else
            {
                s_gateway_connected = true;
            }
            s_ack_received = true;
            break;
        }
        case ESPNOW_MSG_NAK:
        {
            if (len < sizeof(espnow_nak_t)) return;
            espnow_nak_t *nak = (espnow_nak_t *)data;
            if (nak->reason == NAK_REASON_GATEWAY_LOST)
            {
                console.printf("[%s] Gateway lost notification (NAK), re-pairing...\n", TAG);
                s_paired = false;
                s_gateway_connected = false;
                s_pair_attempts = 0;
            }
            break;
        }
        case ESPNOW_MSG_RESTART:
        {
            if (len < sizeof(espnow_restart_t)) return;
            espnow_restart_t *rst = (espnow_restart_t *)data;
            if (mac_equal(rst->target_mac, s_my_mac))
            {
                console.printf("[%s] Restart command received, rebooting...\n", TAG);
                if (s_paired) {
                    espnow_send_heartbeat();
                    delay(50);
                }
                delay(100);
                ESP.restart();
            }
            break;
        }
    }
}


#define ESPNOW_HEADER_FIXED_SIZE (sizeof(espnow_header_t) - sizeof(((espnow_header_t*)0)->payload))

static bool espnow_send_data(void)
{
    if (!s_paired || !s_espnow_ready) return false;

    uint8_t buf[ESPNOW_HEADER_FIXED_SIZE + sizeof(payload_dht_gas_t) + 4];
    memset(buf, 0, sizeof(buf));

    espnow_header_t *hdr = (espnow_header_t *)buf;
    hdr->version = ESPNOW_PROTOCOL_VERSION;
    hdr->msg_type = ESPNOW_MSG_SENSOR_DATA;
    hdr->sequence = s_sequence++;
    WiFi.macAddress(hdr->sensor_mac);
    hdr->sensor_type = SENSOR_TYPE_DHT_GAS;
    hdr->battery_pct = (uint8_t)s_battery;
    hdr->rssi = (int16_t)WiFi.RSSI();

    payload_dht_gas_t *pl = (payload_dht_gas_t *)hdr->payload;
    if (s_enable_temp)
    {
        pl->temperature = s_temperature;
        pl->humidity = s_humidity;
    }
    else
    {
        pl->temperature = 0;
        pl->humidity = 0;
    }
    if (s_enable_gas)
    {
        pl->gas_level = (uint16_t)s_gas_level;
        pl->alarm = s_alarm ? 1 : 0;
    }
    else
    {
        pl->gas_level = 0;
        pl->alarm = 0;
    }

    IPAddress ip = WiFi.localIP();
    uint8_t *ip_ptr = hdr->payload + sizeof(payload_dht_gas_t);
    ip_ptr[0] = ip[0];
    ip_ptr[1] = ip[1];
    ip_ptr[2] = ip[2];
    ip_ptr[3] = ip[3];
    hdr->payload_len = sizeof(payload_dht_gas_t) + 4;

    if (!espnow_client_add_peer(s_gateway_mac, TAG))
    {
        console.printf("[%s] Failed to add gateway peer\n", TAG);
        return false;
    }

    s_ack_received = false;
    s_send_pending = true;
    if (!espnow_send_wrapper(s_broadcast_mac, buf, sizeof(buf), TAG))
    {
        s_send_pending = false;
        return false;
    }
    return true;
}

